:PROPERTIES:
:ID:       74184b53-0143-4a34-83d8-2c07c49f082c
:END:
#+TITLE: Emacs-Migrate-To-Doom-Round-3ish

#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: title:nil author:nil c:nil d:(not "LOGBOOK") date:nil
#+OPTIONS: e:t email:nil f:t inline:t num:t p:nil pri:nil stat:t
#+OPTIONS: tags:t tasks:t tex:t timestamp:t todo:t |:t
#+OPTIONS: toc:nil
#+OPTIONS: html-style:nil
#+HTML_HEAD_EXTRA: <style>tr:nth-child(even) {background-color: #f2f2f2;}</style>
#+HTML_HEAD_EXTRA: <style>h2,h3,h4,h5,p {padding: 0.1rem; margin:0.1rem}</style>
#+HTML_HEAD_EXTRA: <style>table {margin: 0.5em}</style>
#+HTML_HEAD_EXTRA: <style>td {padding: 0.1rem; border:2px}</style>

Seriously, I used my computer like 15 times from July through End of september
and like 3 times from september through end of december...

Just wandering aimlessly from incompatible system to incompatible system. I
really need proximity and connection to other people who are passionate about
tech... but my life is a basically a horrific amalgamation of other peoples'
lies.

and some good will mixed in i'm sure...

*** Only in guixemacs

#+begin_src shell
diff -u $HOME/$doomemacs/.local/straight/repos $HOME/$guixemacs/straight/repos \
    | grep -e "Only.*$guixemacs" | sed -E 's/.*: //g'
#+end_src

#+RESULTS:
| activities.el           |
| alert                   |
| biblio.el               |
| buffer-move             |
| bufler.el               |
| burly.el                |
| casual-avy              |
| casual-calc             |
| casual-info             |
| casual-isearch          |
| casual-lib              |
| combobulate             |
| compile-multi           |
| consult-eglot           |
| consult-flyspell        |
| consult-git-log-grep    |
| consult-recoll          |
| delight                 |
| detached.el             |
| diminish.el             |
| dired-hacks             |
| dts-mode                |
| ef-themes               |
| eglot                   |
| elisp-depmap.el         |
| emacs-arei              |
| emacs-go-tag            |
| emacs-reformatter       |
| emacs-xml-format        |
| external-completion     |
| firestarter             |
| flymake-shellcheck      |
| geiser                  |
| git-link                |
| gntp.el                 |
| graphql.el              |
| graphviz-dot-mode       |
| guile                   |
| helm-bibtex             |
| highlight-indent-guides |
| highlight-symbol.el     |
| i-ching                 |
| info-plus               |
| jsonrpc                 |
| kanji-mode              |
| kind-icon               |
| let-alist               |
| log4e                   |
| magit-tbdiff            |
| magit-todos             |
| major-mode-hydra.el     |
| mc                      |
| no-littering            |
| openwith                |
| org-ref                 |
| pass                    |
| password-store          |
| password-store-otp.el   |
| pcre2el                 |
| persist                 |
| plz                     |
| pomm.el                 |
| popper                  |
| pulsar                  |
| rec-mode                |
| repo-el                 |
| repology                |
| srht                    |
| svg-lib                 |
| swagg.el                |
| tabspaces               |
| tldr.el                 |
| tmr                     |
| track-changes           |
| tramp                   |
| visual-fill-column      |
| yasnippet-snippets      |


*** Only in doom

#+begin_src shell
diff -u $HOME/$doomemacs/.local/straight/repos $HOME/$guixemacs/straight/repos \
    | grep -e "Only.*$doomemacs" | sed -E 's/.*: //g'
#+end_src

#+RESULTS:
| adaptive-wrap          |
| ammonite-term-repl     |
| anaconda-mode          |
| android-mode           |
| anzu                   |
| arei                   |
| auctex                 |
| auto-minor-mode        |
| auto-yasnippet         |
| better-jumper          |
| bind-key               |
| browse-at-remote       |
| bundler.el             |
| cdlatex                |
| centered-window-mode   |
| cfrs                   |
| cider                  |
| citar                  |
| citar-org-roam         |
| clj-refactor.el        |
| clojure-mode           |
| cmake-mode             |
| code-review            |
| consult-lsp            |
| csv-mode               |
| cuda-mode              |
| dap-mode               |
| demangle-mode          |
| diff-hl                |
| diredfl                |
| dirvish                |
| disaster               |
| dockerfile-mode        |
| doom-modeline          |
| drag-stuff.el          |
| dtrt-indent            |
| dumb-jump              |
| edit-indirect          |
| elisp-def              |
| elisp-refs             |
| elisp-tree-sitter      |
| emacs-0x0              |
| emacs-buttercup        |
| emacs-ccls             |
| emacs-deferred         |
| emacs-emojify          |
| emacs-go-tag           |
| emacs-hide-mode-line   |
| emacs-load-env-vars    |
| emacs-load-relative    |
| emacs-loc-changes      |
| emacs-promise          |
| emacs-pug-mode         |
| emacs-python-pytest    |
| emacs-sbt-mode         |
| emacs-scala-mode       |
| emacs-slim             |
| emacs-solaire-mode     |
| emacs-test-simple      |
| emacs-web-server       |
| emacs-websocket        |
| emacs-zmq              |
| epl                    |
| expand-region.el       |
| flycheck-cask          |
| flycheck-clj-kondo     |
| flycheck-golangci-lint |
| flycheck-package       |
| flycheck-plantuml      |
| flycheck-popup-tip     |
| fringe-helper.el       |
| git-modes              |
| glsl-mode              |
| gnuplot                |
| gnuplot-mode           |
| go-eldoc               |
| go-gen-test            |
| goggles                |
| go-mode.el             |
| gorepl-mode            |
| graphql-doc.el         |
| groovy-emacs-modes     |
| haml-mode              |
| haskell-mode           |
| helpful                |
| highlight-numbers      |
| highlight-quoted       |
| hy-mode                |
| inf-ruby               |
| jade-mode              |
| jet.el                 |
| js2-refactor.el        |
| julia-emacs            |
| julia-repl             |
| jump.el                |
| jupyter                |
| latex-preview-pane     |
| link-hint.el           |
| lsp-docker             |
| lsp-haskell            |
| lsp-java               |
| lsp-julia              |
| lsp-metals             |
| lsp-mode               |
| lsp-tailwindcss        |
| lsp-treemacs           |
| lsp-ui                 |
| lua-mode               |
| macrostep              |
| makefile-executor.el   |
| markdown-toc           |
| minitest-emacs         |
| modern-cpp-font-lock   |
| multiple-cursors.el    |
| neil                   |
| nerd-icons-completion  |
| nerd-icons.el          |
| nix-update-el          |
| nodejs-repl.el         |
| nose                   |
| npm-mode               |
| ob-ammonite            |
| ob-async               |
| ob-clojure-literate    |
| ob-go                  |
| ob-hy                  |
| ob-restclient.el       |
| ob-translate           |
| opencl-mode            |
| org-appear             |
| org-cliplink           |
| org-fancy-priorities   |
| orgit                  |
| orgit-forge            |
| org-noter              |
| org-pdftools           |
| org-re-reveal          |
| org-roam               |
| org-superstar-mode     |
| org-tree-slide         |
| overseer.el            |
| ox-clip                |
| package-lint           |
| paredit                |
| parent-mode            |
| parseclj               |
| parseedn               |
| pfuture                |
| pipenv.el              |
| pip-requirements.el    |
| pkg-info               |
| plantuml-mode          |
| posframe               |
| projectile             |
| pyimport               |
| py-isort.el            |
| pythonic               |
| pyvenv                 |
| qml-mode               |
| qt-pro-mode            |
| quickrun               |
| rake                   |
| realgud                |
| realgud-trepan-ni      |
| restart-emacs          |
| reveal.js              |
| rjsx-mode              |
| robe                   |
| rspec-mode             |
| rubocop-emacs          |
| ruby-json-to-hash.el   |
| rustic                 |
| rust-mode              |
| sass-mode              |
| saveplace-pdf-view     |
| shrink-path.el         |
| shut-up                |
| skewer-mode            |
| sly-asdf               |
| sly-macrostep          |
| sly-overlay            |
| sly-quicklisp          |
| sly-repl-ansi-color    |
| sly-stepper            |
| snippets               |
| spinner                |
| themes                 |
| tide                   |
| toc-org                |
| treemacs               |
| tree-sitter-indent.el  |
| tree-sitter-langs      |
| ts-fold                |
| use-package            |
| uuidgen-el             |
| vimish-fold            |
| vi-tilde-fringe        |
| web-mode               |
| xref-js2               |
| xterm-color            |
| yaml-mode              |
| yard-mode.el           |
| yasnippet-capf         |

*** In Both

#+begin_src shell
diff -u $HOME/$doomemacs/.local/straight/repos $HOME/$guixemacs/straight/repos \
    | grep -e "Common.*$guixemacs" | sed -E 's/^Common.*\///g'
#+end_src

#+RESULTS:
| ace-window         |
| a.el               |
| apheleia           |
| archive-rpm        |
| astro-ts-mode      |
| aurel              |
| avy                |
| bui.el             |
| cape               |
| citeproc-el        |
| closql             |
| compat             |
| consult            |
| consult-dir        |
| consult-flycheck   |
| consult-yasnippet  |
| corfu              |
| crontab-mode       |
| d2-mode            |
| daemons.el         |
| dash.el            |
| docker.el          |
| editorconfig-emacs |
| eldoc              |
| elf-mode           |
| el-get             |
| elisp-demos        |
| emacs-aio          |
| emacs-async        |
| emacs-htmlize      |
| emacs-libvterm     |
| emacsmirror-mirror |
| emacsql            |
| emacs-request      |
| Emacs-wgrep        |
| emacs-which-key    |
| embark             |
| emmet-mode         |
| envrc              |
| eros               |
| f.el               |
| flycheck           |
| forge              |
| gcmh               |
| general.el         |
| ghub               |
| git-timemachine    |
| gnu-elpa-mirror    |
| google-translate   |
| graphql-mode       |
| hcl-mode           |
| hide-lines         |
| hl-todo            |
| hsluv-emacs        |
| ht.el              |
| html-ts-mode       |
| hydra              |
| iedit              |
| inheritenv         |
| journalctl-mode    |
| jq-mode            |
| js2-mode           |
| json-mode          |
| json-snatcher      |
| lispy              |
| magit              |
| map                |
| marginalia         |
| markdown-mode      |
| melpa              |
| mermaid-mode       |
| nix-mode           |
| nongnu-elpa        |
| ob-graphql         |
| ob-mermaid         |
| ob-nix             |
| ob-smiles          |
| orderless          |
| org                |
| org-contrib        |
| ov                 |
| ox-pandoc          |
| parsebib           |
| pdf-tools          |
| popup-el           |
| project            |
| protobuf           |
| queue              |
| rainbow-delimiters |
| rainbow-mode       |
| restclient.el      |
| s.el               |
| seq                |
| sesman             |
| sly                |
| smartparens        |
| smiles-mode        |
| ssh-config-mode-el |
| straight.el        |
| string-inflection  |
| swiper             |
| syslog-mode        |
| systemd-mode       |
| tablist            |
| terraform-mode     |
| transient          |
| treepy.el          |
| typescript.el      |
| undo-tree          |
| vertico            |
| with-editor        |
| ws-butler          |
| x509-mode          |
| xref               |
| yaml.el            |
| yasnippet          |
| zoutline           |

